app/views/category_events/beauty.html.erb

	<h2><%= @category_event.title %></h2>
	<p><%= image_tag(Photo.find(@category_event.icon).title , alt:"", style: 'width: 50%;') %><%= @category_event.description %></p>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]