app/views/admin/photo_in_articles/_form.html.erb

  <% end %></div>
  <div class="field"><%= form.label :article %><%= form.collection_select(:photo, Article.all, :id, :title)%></div>
---
SELECT "articles".* FROM "articles"