app/views/admin/photo_in_articles/index.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    <td>
      <% photo = Photo.find_by(id: one_photo_in_article.photo) %>

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <td>
      <% article = Article.find_by(id: one_photo_in_article.article) %>