app/views/admin/events/_form.html.erb

SELECT "category_events".* FROM "category_events"
---
    <tr>
      <td><div class="field"><%= form.label :category %><%= form.collection_select(:category, CategoryEvent.all, :id, :title) %></div></td>