app/views/admin/events/beauty.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	<div class="about-us-image-set"><% @old_list.each do |one_photo_id| %>
		<% photo = Photo.find_by(id: one_photo_id) %>