app/views/admin/events/index.html.erb

      <td>
        <% temp_icon = Photo.find_by(id: one_event.icon) %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      <td>
        <% category = CategoryEvent.find_by(id: one_event.category) %>
---
SELECT  "category_events".* FROM "category_events" WHERE "category_events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]