app/controllers/admin/category_events_controller.rb

SELECT  "category_events".* FROM "category_events" ORDER BY "category_events"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @category_events = CategoryEvent.all.order(updated_at: :desc)

SELECT  "category_events".* FROM "category_events" WHERE "category_events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_category_event
      @category_event = CategoryEvent.find(params[:id])