app/controllers/admin/events_controller.rb

  def index
    @events = Event.all.order(updated_at: :desc)
---
SELECT  "events".* FROM "events" ORDER BY "events"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]