app/controllers/admin/photos_controller.rb

UPDATE "photos" SET "description" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["description", "свадьба"], ["updated_at", "2017-07-20 13:24:19.634849"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @photo.update(photo_params)