app/controllers/admin/photo_in_articles_controller.rb

  def index
    @photo_in_articles = PhotoInArticle.all.order(updated_at: :desc)
---
SELECT  "photo_in_articles".* FROM "photo_in_articles" ORDER BY "photo_in_articles"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]