app/controllers/admin/photo_in_events_controller.rb

  def index
    @photo_in_events = PhotoInEvent.all.order(updated_at: :desc)
---
SELECT  "photo_in_events".* FROM "photo_in_events" ORDER BY "photo_in_events"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]

    def set_photo_in_event
      @photo_in_event = PhotoInEvent.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]