app/views/guest_pages/eventlist.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			<div class="album-bg">
				<% temp_icon = Photo.find_by(id: state.icon) %>