app/views/guest_pages/kitchen.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	<div class="owl-carousel"><% @kitchen_photo_list.each do |dishe| %><div class="big-block">
		<div class="background"><%= image_tag(Photo.find(dishe.photo).title) %></div>