app/views/guest_pages/list_of_articles.html.erb

	<hr class = "spec-hr"/>
	<div class="articles"><% @article_list.each do |state| %><div class="article">
		<div class="article-img"><%= image_tag(Photo.find(state.icon).title) %></div>
---
SELECT  "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]