app/views/guest_pages/main.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	<div class="background owl-carousel"><% @main_photo_list.to_a.each do |one_phot_in_sl| %>
		<%= image_tag(Photo.find(one_phot_in_sl.photo).title) %>