app/views/guest_pages/map_park.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
				<div class = "karta-image">
					<% photo = Photo.find_by(id: one_tent.icon) %>