app/views/admin/articles/beauty.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	<table width="100%"><tbody><tr>
		<td width="50%"><%= image_tag(Photo.find(@article.icon).title , alt:"", style: 'width: 100%;') %></td>