app/views/admin/articles/index.html.erb

      <% else %>
        <% photo = Photo.find(one_article.icon) %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]