app/views/articles/index.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
      <% else %>
        <% photo = Photo.find(one_article.icon) %>