app/views/admin/tents/index.html.erb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    <td>
      <% photo = Photo.find_by(id: tent.icon) %>