app/views/events/_form.html.erb

    <tr>
      <td><div class="field"><%= form.label :category %><%= form.collection_select(:category, CategoryEvent.all, :id, :title) %></div></td>
---
SELECT "category_events".* FROM "category_events"