app/views/events/index.html.erb

SELECT  "category_events".* FROM "category_events" WHERE "category_events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <% if one_event.category.nil? || one_event.category < 1 %><i>category not exist</i>
        <% else %><%= CategoryEvent.find(one_event.category).title %>

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
        <% else %>
          <% photo = Photo.find(one_event.icon) %>