app/views/events/show.html.erb

<% @old_list.each do |one_foto_id| %>
	,<%= image_tag(Photo.find(one_foto_id).title, style: "width: 100px;") %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]