app/views/admin/category_events/beauty.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	<div class="about-us-image-set"><% @old_list.each do |state_id| %>
		<% state = Event.find_by(id: state_id) %>
		<% unless state.nil? %><a href="//localhost:3000/events/<%=state.id.to_s%><%=@word_to_see %>" class = "album">
			<% temp_icon = Photo.find_by(id: state.icon) %>