app/views/admin/category_events/index.html.erb

      <% else %>
        <% photo = Photo.find(category_event.icon) %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]