app/controllers/articles_controller.rb

  def index
    @articles = Article.all.order(updated_at: :desc)
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]