app/controllers/category_events_controller.rb

    def set_category_event
      @category_event = CategoryEvent.find(params[:id])
---
SELECT  "category_events".* FROM "category_events" WHERE "category_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."category" = $1  [["category", 1]]