app/controllers/events_controller.rb

  def index
    @events = Event.all.order(updated_at: :desc)
---
SELECT  "events".* FROM "events" ORDER BY "events"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3