app/controllers/guest_pages_controller.rb

	def main
		@main_slayder = Slayder.find_by(title: "главная")
		if !@main_slayder.nil?
			@main_photo_list = PhotoInSlayder.where(slyder: @main_slayder.id)
		end
		@category_list = CategoryEvent.all
---
SELECT  "slayders".* FROM "slayders" WHERE "slayders"."title" = $1 LIMIT $2  [["title", "главная"], ["LIMIT", 1]]
SELECT "photo_in_slayders".* FROM "photo_in_slayders" WHERE "photo_in_slayders"."slyder" = $1  [["slyder", 2]]
SELECT "category_events".* FROM "category_events"

	def kitchen
		@kitchen_slayder = Slayder.find_by(title: "кухня")
		@visible_part = !(@kitchen_slayder.nil?)
		if @visible_part
			@kitchen_photo_list = PhotoInSlayder.where(slyder: @kitchen_slayder.id)
---
SELECT  "slayders".* FROM "slayders" WHERE "slayders"."title" = $1 LIMIT $2  [["title", "кухня"], ["LIMIT", 1]]
SELECT "photo_in_slayders".* FROM "photo_in_slayders" WHERE "photo_in_slayders"."slyder" = $1  [["slyder", 1]]

	def review
		@opinion_list = Opinion.paginate(:page => params[:page])
---
SELECT  "opinions".* FROM "opinions" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "opinions"

	def list_of_articles
		@article_list = Article.paginate(:page => params[:page])
---
SELECT  "articles".* FROM "articles" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

	def map_park
		@tent_list = Tent.all
---
SELECT "tents".* FROM "tents"

	def eventlist
		@event_list = Event.paginate(:page => params[:page])
---
SELECT  "events".* FROM "events" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "events"