app/controllers/not_published_opinions_controller.rb

  def index
    @not_published_opinions = NotPublishedOpinion.all
---
SELECT "not_published_opinions".* FROM "not_published_opinions"

  def create
    @not_published_opinion = NotPublishedOpinion.new(not_published_opinion_params)
    respond_to do |format|
      if @not_published_opinion.save
---
INSERT INTO "not_published_opinions" ("author", "words", "visit", "email", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author", "bug"], ["words", "error.message"], ["visit", "2017-07-10"], ["email", " "], ["phone", 13], ["created_at", "2017-07-10 16:43:32.278012"], ["updated_at", "2017-07-10 16:43:32.278012"]]

  def destroy
    @not_published_opinion.destroy
---
DELETE FROM "not_published_opinions" WHERE "not_published_opinions"."id" = $1  [["id", 1]]

    def set_not_published_opinion
      @not_published_opinion = NotPublishedOpinion.find(params[:id])
---
SELECT  "not_published_opinions".* FROM "not_published_opinions" WHERE "not_published_opinions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]