app/controllers/opinions_controller.rb

SELECT  "opinions".* FROM "opinions" ORDER BY "opinions"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @opinions = Opinion.all.order(updated_at: :desc)