app/controllers/photo_in_events_controller.rb

SELECT  "photo_in_events".* FROM "photo_in_events" ORDER BY "photo_in_events"."updated_at" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @photo_in_events = PhotoInEvent.all.order(updated_at: :desc)

DELETE FROM "photo_in_events" WHERE "photo_in_events"."id" = $1  [["id", 82]]
---
  def destroy
    @photo_in_event.destroy

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photo_in_events".* FROM "photo_in_events" WHERE "photo_in_events"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]
---
    def set_photo_in_event
      @photo_in_event = PhotoInEvent.find(params[:id])