app/views/admin/dashboards/dashboard_white_park.html.erb

            <div class="ibox-content">
                <h1 class="no-margins"><%= Photo.count %></h1>
                <small>Фотографий всего</small>
                <% nphwd = Photo.where(description: "").count %>
---
SELECT COUNT(*) FROM "photos"
SELECT COUNT(*) FROM "photos" WHERE ("photos"."description" != $1)  [["description", ""]]

            <div class="ibox-content">
                <h1 class="no-margins"><%= Article.count %></h1>
---
SELECT COUNT(*) FROM "articles"

                <hr>
                <h1 class="no-margins"><%= Event.count %></h1>
                <small>опубликованых событий в <%= CategoryEvent.count %> категориях</small>
---
SELECT COUNT(*) FROM "events"
SELECT COUNT(*) FROM "category_events"

            <div class="ibox-content">
                <h1 class="no-margins"><%= User.count %></h1>
---
SELECT COUNT(*) FROM "users"

                <hr>
                <h1 class="no-margins"><%= Opinion.count %></h1>
---
SELECT COUNT(*) FROM "opinions"

                <h3><i class="fa fa-envelope-o"></i>Новые мнения</h3>
                <small><i class="fa fa-tim"></i>У вас <%= NotPublishedOpinion.count %> немодерированых отзывов.</small>
---
SELECT "not_published_opinions".* FROM "not_published_opinions"
SELECT COUNT(*) FROM "not_published_opinions"