app/views/admin/photo_in_events/_form.html.erb

  <% end %></div>
  <div class="field"><%= form.label :event %><%= form.collection_select(:event, Event.all, :id, :title) %></div>
---
SELECT "events".* FROM "events"