app/views/admin/photo_in_events/index.html.erb

      <% else %>
        <% photo = Photo.find(photo_in_event.photo) %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    <td><% if photo_in_event.event.nil? || photo_in_event.event < 1 %>event not exist
      <% else %><%= Event.find(photo_in_event.event).title %>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]