app/views/layouts/_header_guest.html.erb

SELECT "category_events".* FROM "category_events"
---
			<p class="sub-main-switch"><i class="fa fa-chevron-down" aria-hidden="true"></i></p></div>
			<div class="sub-main"><% CategoryEvent.all.each do |one_category| %>